## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 13 to add, 1 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| update | `aws_cloudwatch_dashboard.ops`                                               |
| add    | `aws_cloudwatch_log_metric_filter.scan_files_api_error[&quot;api&quot;]`               |
|        | `aws_cloudwatch_log_metric_filter.scan_files_api_error[&quot;api-provisioned&quot;]`   |
|        | `aws_cloudwatch_log_metric_filter.scan_files_api_warning[&quot;api&quot;]`             |
|        | `aws_cloudwatch_log_metric_filter.scan_files_api_warning[&quot;api-provisioned&quot;]` |
|        | `aws_cloudwatch_log_metric_filter.scan_verdict_unknown[&quot;api&quot;]`               |
|        | `aws_cloudwatch_log_metric_filter.scan_verdict_unknown[&quot;api-provisioned&quot;]`   |
|        | `aws_cloudwatch_metric_alarm.scan_files_api_error[&quot;api&quot;]`                    |
|        | `aws_cloudwatch_metric_alarm.scan_files_api_error[&quot;api-provisioned&quot;]`        |
|        | `aws_cloudwatch_metric_alarm.scan_files_api_warning[&quot;api&quot;]`                  |
|        | `aws_cloudwatch_metric_alarm.scan_files_api_warning[&quot;api-provisioned&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.scan_verdict_unknown[&quot;api&quot;]`                    |
|        | `aws_cloudwatch_metric_alarm.scan_verdict_unknown[&quot;api-provisioned&quot;]`        |
|        | `aws_shield_protection.cloudfront_api_sync`                                  |
| delete | `aws_cloudwatch_log_metric_filter.scan_files_api_error`                      |
|        | `aws_cloudwatch_log_metric_filter.scan_files_api_warning`                    |
|        | `aws_cloudwatch_log_metric_filter.scan_verdict_unknown`                      |
|        | `aws_cloudwatch_metric_alarm.scan_files_api_error`                           |
|        | `aws_cloudwatch_metric_alarm.scan_files_api_warning`                         |
|        | `aws_cloudwatch_metric_alarm.scan_verdict_unknown`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.ops will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "ops" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                  ~ {
                      ~ properties = {
                          ~ alarms = [
                              - "arn:aws:cloudwatch:ca-central-1:127893201980:alarm:ErrorLoggedAPI",
                              + "arn:aws:cloudwatch:ca-central-1:127893201980:alarm:ErrorLogged-api",
                                "arn:aws:cloudwatch:ca-central-1:127893201980:alarm:ErrorLoggedS3ScanObject",
                                # (1 unchanged element hidden)
                            ]
                            # (1 unchanged element hidden)
                        }
                        # (5 unchanged elements hidden)
                    },
                    {
                        height     = 16
                        properties = {
                            labels        = [
                                {
                                    key   = "FunctionName"
                                    value = "scan-files-api"
                                },
                                {
                                    key   = "FunctionName"
                                    value = "s3-scan-object"
                                },
                                {
                                    key   = "FunctionName"
                                    value = "s3-scan-object-integration-test"
                                },
                            ]
                            metrics       = [
                                {
                                    metricName   = "Invocations"
                                    resourceType = "AWS::Lambda::Function"
                                    stat         = "Sum"
                                },
                                {
                                    metricName   = "Duration"
                                    resourceType = "AWS::Lambda::Function"
                                    stat         = "Average"
                                },
                                {
                                    metricName   = "Errors"
                                    resourceType = "AWS::Lambda::Function"
                                    stat         = "Sum"
                                },
                                {
                                    metricName   = "ConcurrentExecutions"
                                    resourceType = "AWS::Lambda::Function"
                                    stat         = "Maximum"
                                },
                            ]
                            period        = 300
                            region        = "ca-central-1"
                            splitBy       = ""
                            title         = "Lambda"
                            widgetOptions = {
                                legend        = {
                                    position = "bottom"
                                }
                                rowsPerPage   = 5
                                stacked       = false
                                view          = "timeSeries"
                                widgetsPerRow = 2
                            }
                        }
                        type       = "explorer"
                        width      = 18
                        x          = 0
                        y          = 4
                    },
                    # (6 unchanged elements hidden)
                ]
            }
        )
        id             = "Ops"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_metric_filter.scan_files_api_error will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_cloudwatch_log_metric_filter" "scan_files_api_error" {
      - id             = "ErrorLoggedAPI" -> null
      - log_group_name = "/aws/lambda/scan-files-api" -> null
      - name           = "ErrorLoggedAPI" -> null
      - pattern        = "?ERROR ?Error ?error ?failed" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "ErrorLoggedAPI" -> null
          - namespace  = "ScanFiles" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_files_api_error["api"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_files_api_error" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/scan-files-api"
      + name           = "ErrorLogged"
      + pattern        = "?ERROR ?Error ?error ?failed"

      + metric_transformation {
          + name      = "ErrorLogged"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_files_api_error["api-provisioned"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_files_api_error" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/scan-files-api-provisioned"
      + name           = "ErrorLogged"
      + pattern        = "?ERROR ?Error ?error ?failed"

      + metric_transformation {
          + name      = "ErrorLogged"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_files_api_warning will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_cloudwatch_log_metric_filter" "scan_files_api_warning" {
      - id             = "WarningLoggedAPI" -> null
      - log_group_name = "/aws/lambda/scan-files-api" -> null
      - name           = "WarningLoggedAPI" -> null
      - pattern        = "WARNING" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "WarningLoggedAPI" -> null
          - namespace  = "ScanFiles" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_files_api_warning["api"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_files_api_warning" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/scan-files-api"
      + name           = "WarningLogged"
      + pattern        = "WARNING"

      + metric_transformation {
          + name      = "WarningLogged"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_files_api_warning["api-provisioned"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_files_api_warning" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/scan-files-api-provisioned"
      + name           = "WarningLogged"
      + pattern        = "WARNING"

      + metric_transformation {
          + name      = "WarningLogged"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_verdict_unknown will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_cloudwatch_log_metric_filter" "scan_verdict_unknown" {
      - id             = "ScanVerdictUnknown" -> null
      - log_group_name = "/aws/lambda/scan-files-api" -> null
      - name           = "ScanVerdictUnknown" -> null
      - pattern        = "?unknown ?unable_to_scan" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "ScanVerdictUnknown" -> null
          - namespace  = "ScanFiles" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_verdict_unknown["api"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_verdict_unknown" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/scan-files-api"
      + name           = "ScanVerdictUnknown"
      + pattern        = "?unknown ?unable_to_scan"

      + metric_transformation {
          + name      = "ScanVerdictUnknown"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_verdict_unknown["api-provisioned"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_verdict_unknown" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/scan-files-api-provisioned"
      + name           = "ScanVerdictUnknown"
      + pattern        = "?unknown ?unable_to_scan"

      + metric_transformation {
          + name      = "ScanVerdictUnknown"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.scan_files_api_error will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_cloudwatch_metric_alarm" "scan_files_api_error" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ] -> null
      - alarm_description         = "Errors logged by the Scan Files API lambda function" -> null
      - alarm_name                = "ErrorLoggedAPI" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:127893201980:alarm:ErrorLoggedAPI" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "ErrorLoggedAPI" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ErrorLoggedAPI" -> null
      - namespace                 = "ScanFiles" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.scan_files_api_error["api"] will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_files_api_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Errors logged by the Scan Files api lambda function"
      + alarm_name                            = "ErrorLogged-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ErrorLogged"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.scan_files_api_error["api-provisioned"] will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_files_api_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Errors logged by the Scan Files api-provisioned lambda function"
      + alarm_name                            = "ErrorLogged-api-provisioned"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ErrorLogged"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.scan_files_api_warning will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_cloudwatch_metric_alarm" "scan_files_api_warning" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ] -> null
      - alarm_description         = "Warnings logged by the Scan Files API lambda function" -> null
      - alarm_name                = "WarningLoggedAPI" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:127893201980:alarm:WarningLoggedAPI" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "WarningLoggedAPI" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "WarningLoggedAPI" -> null
      - namespace                 = "ScanFiles" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 5 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.scan_files_api_warning["api"] will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_files_api_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Warnings logged by the Scan Files api lambda function"
      + alarm_name                            = "WarningLogged-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WarningLogged"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.scan_files_api_warning["api-provisioned"] will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_files_api_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Warnings logged by the Scan Files api-provisioned lambda function"
      + alarm_name                            = "WarningLogged-api-provisioned"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WarningLogged"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.scan_verdict_unknown will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_cloudwatch_metric_alarm" "scan_verdict_unknown" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ] -> null
      - alarm_description         = "Scans that returned an unknown or unable to scan verdict" -> null
      - alarm_name                = "ScanVerdictUnknown" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:127893201980:alarm:ScanVerdictUnknown" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "ScanVerdictUnknown" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ScanVerdictUnknown" -> null
      - namespace                 = "ScanFiles" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.scan_verdict_unknown["api"] will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_verdict_unknown" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Scans from the api that returned an unknown or unable to scan verdict"
      + alarm_name                            = "ScanVerdictUnknown-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ScanVerdictUnknown"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.scan_verdict_unknown["api-provisioned"] will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_verdict_unknown" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Scans from the api-provisioned that returned an unknown or unable to scan verdict"
      + alarm_name                            = "ScanVerdictUnknown-api-provisioned"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ScanVerdictUnknown"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_shield_protection.cloudfront_api_sync will be created
  + resource "aws_shield_protection" "cloudfront_api_sync" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "CloudFrontAPISync"
      + resource_arn = "arn:aws:cloudfront::127893201980:distribution/E370PBXH8XPDYT"
      + tags         = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

Plan: 13 to add, 1 to change, 6 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_health_check_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.s3_scan_object_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_api_error[\"api\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_api_error[\"api-provisioned\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_api_warning[\"api\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_api_warning[\"api-provisioned\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_verdict_unknown[\"api\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_verdict_unknown[\"api-provisioned\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_warning_us_east"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.s3_scan_object_error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scan_files_api_error[\"api\"]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scan_files_api_error[\"api-provisioned\"]"]
WARN - plan.json - main - Cloudwatch log...
```

</details>
